pet_examples/evaluation/model_comp_corr/gpt3/graphviz/rules/3_3.gv
digraph G {
  rankdir=LR;
  start_1[shape=circle label=""];
  task_1[shape=rectangle label="Register Claim"];
  task_2[shape=rectangle label="Examine Claim"];
  seg_1[shape=diamond label="X"];
  task_3[shape=rectangle label="Write Settlement Recommendation"];
  task_4[shape=rectangle label="Check Recommendation"];
  task_5[shape=rectangle label="Send Back"];
  end_1[shape=doublecircle label=""];
  start_1 -> task_1;
  task_1 -> task_2;
  task_2 -> seg_1;
  seg_1 -> task_3[label="OK"];
  seg_1 -> task_4[label="Not OK"];
  task_3 -> end_1;
  task_4 -> task_5;
  task_5 -> seg_1;
}
